000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВидЦенИнтернет</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОстатковПриОтменеПроведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяСкидкаНаПодарочныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйПроцентРучнойСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТестовогоМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаЛетнееВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПереходаНаЗимнееВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольОписанияПричиныРучнойСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>СкладЦентральныйИнтернетМагазина</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>EnumRef.ВидыПрограммЛояльности</types>
    </type>
  </resources>
  <resources>
    <name>ПродажиДляCRMпослеЗакрытияСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УслугаДоставкиЗаказаПокупателя</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОплатыЧастямиДляЦенника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеХарактеристикиДляПересчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеХарактеристикиДляПересчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокУдаления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокироватьОперацииПриОтсутствииСоединенияЦБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПереносДокументаВДругойПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьNavisionПоступлениеПереброски</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаксимальнаяСуммаНакопленияЛояльности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьПеремещенияПоЗаказамВЦентре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьТолькоТорговыйЗал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбменССайтомНаПериферийныхУзлах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБонуснуюСистему</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеНачислятьБаллыПриОплатеБонусами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьУкраинскоеНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазмерПакетаВиртуальныхКартРезерва</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьСверкуИнформативныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЧекиКакРегистраторыНачисленияБонусныхБаллов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДвиженияБонусныхБалловТолькоВЦентре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаПродажиМинимальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПечататьВЧекеДанныеБонусногоСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПрямуюИнтеграциюMagento</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОплатуБонусамиПоЗаказуПокупателяНаРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОплатуБонуснымиБалламиПодарочныхСертификатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>TimeoutDDos</name>
    <comment>Минимальный интервал между запросами из внешних систем</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсеПродажиБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяУчетаКассовогоДня</name>
    <comment>Минимальное время, когда можно учесть КД для NAV</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПротоколФормРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколВерсииОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГлубинаОповещенияОбАннуляцииБонусныхБаллов</name>
    <comment>Глубина в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьЗагрузкуОбменаПередОбновлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалОграниченияВыгрузкиСообщенияОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПериодРассчитанныхИтогов</name>
    <comment>Используется в периферийных информационных базах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНаличныхОграничение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаказаПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБесплатнойДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладЗакупки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>МинимальнаяСуммаАвтовыполнения</name>
    <comment>Минимальная сумма интернет-заказа для автовыполнения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрагентНовойПочты</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицоНовойПочты</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаСлужбыДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ИДКлинтаАвтоЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСкидкуСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеНачислятьБонусыПриСписанииАкционныхБонусов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСтаруюСистемуОтпракиСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетнаяПолитика/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Перем ИспользоватьБонуснуюСистему;	//	условие обновления интерфейса

#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 27.07.2021 05:27:24
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("АдминистраторПолномочный", Ложь) = Истина Тогда

		ТолькоПросмотр = Истина;

	КонецЕсли;

	Элементы.СписокПрефиксов.ТолькоПросмотр = НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("РазрешитьИзменениеПрефиксаКартыДисконта", Ложь) = Истина
										  ИЛИ НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел();

	ПолучитьДанныеХранилища();
	КомандаОбновитьРазмерРезерваНаСервере();	//	LNK 17.08.2021 05:43:19

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ИспользоватьБонуснуюСистему = Запись.ИспользоватьБонуснуюСистему;

	Если НЕ ПустаяСтрока(ИмяТекущейСтраницы) Тогда

		Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяТекущейСтраницы];

	КонецЕсли;
	
	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	ИмяТекущейСтраницы = Элементы.Страницы.ТекущаяСтраница.Имя;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("РазрешитьИзменениеПрефиксаКартыДисконта", Ложь) = Истина Тогда

		УстановитьДанныеХранилища();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ПолучитьДанныеХранилища();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьОформлениеЭлементов();

	Оповестить("УчетнаяПолитика.Изменение", Запись, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЭлементыПриИзменении(Элемент)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура СписокПрефиксовПометкаПриИзменении(Элемент)

	Для каждого ЭлементСписка Из СписокПрефиксов Цикл

		Если ЭлементСписка.Пометка И НЕ ЭлементСписка.Значение = Элементы.СписокПрефиксов.ТекущиеДанные.Значение Тогда

			ЭлементСписка.Пометка = Ложь;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()

	Элементы.ИспользоватьБонуснуюСистему.ШрифтЗаголовка = Новый Шрифт(,, Запись.ИспользоватьБонуснуюСистему);

	Элементы.НеНачислятьБаллыПриОплатеБонусами.Видимость						= Запись.ИспользоватьБонуснуюСистему;
	Элементы.ИспользоватьЧекиКакРегистраторыНачисленияБонусныхБаллов.Видимость	= Запись.ИспользоватьБонуснуюСистему;
	Элементы.ДвиженияБонусныхБалловТолькоВЦентре.Видимость						= Запись.ИспользоватьБонуснуюСистему;
	Элементы.ПечататьВЧекеДанныеБонусногоСчета.Видимость						= Запись.ИспользоватьБонуснуюСистему;

	Для каждого ЭлементСписка Из СписокПрефиксов Цикл

		Если ЭлементСписка.Пометка Тогда

			Элементы.СписокПрефиксов.ТекущаяСтрока = ЭлементСписка.ПолучитьИдентификатор();
			Прервать;

		КонецЕсли;

	КонецЦикла;

	Если НЕ ИспользоватьБонуснуюСистему = Запись.ИспользоватьБонуснуюСистему Тогда

		ПоказатьОповещениеПользователя("Обновление интерфейса",, "Изменён флаг, определяющий отображение данных.", БиблиотекаКартинок.Предупреждение32);
		ИспользоватьБонуснуюСистему = Запись.ИспользоватьБонуснуюСистему;

		ОбновитьИнтерфейс();
		ОбновитьФорму();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()

	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	ЗначениеВРеквизитФормы(ЗаписьОбъект, "Запись");

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеХранилища()

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Возврат;

	КонецЕсли;

	ДанныеХранилища = РегистрыСведений.БезопасноеХранилищеДанных.ДанныеПрочитать(РегистрыСведений.УчетнаяПолитика.КлючБезопасногоХранилища()).Получить();

	РегистрыСведений.УчетнаяПолитика.ПроверитьСтруктуруХранилища(ДанныеХранилища);

//	---------------------------------------------------------------------------------------

	СписокПрефиксов.Очистить();

	ПрефиксТекущий = Константы.ПрефиксКартыДисконта.Получить();

	Для каждого Префикс Из ДанныеХранилища.ПрефиксыКарт Цикл

		СписокПрефиксов.Добавить(Префикс,, Префикс = ПрефиксТекущий);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеХранилища()

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Возврат;

	КонецЕсли;

	ДанныеХранилища.ПрефиксыКарт.Очистить();

	Для каждого ЭлементСписка Из СписокПрефиксов Цикл

		Префикс = ЭлементСписка.Значение;

		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Префикс) Тогда

			ТекстОшибки = "Ключ «" + Префикс + "» имеет неверное значение - допустимы только литеры латинского алфавита.";
			ВызватьИсключение ТекстОшибки;

		Иначе

			ДанныеХранилища.ПрефиксыКарт.Добавить(Префикс);

		КонецЕсли;

	КонецЦикла;

	РегистрыСведений.БезопасноеХранилищеДанных.ДанныеЗаписать(РегистрыСведений.УчетнаяПолитика.КлючБезопасногоХранилища(), ДанныеХранилища,, Ложь);

	Для каждого ЭлементСписка Из СписокПрефиксов Цикл

		Если ЭлементСписка.Пометка Тогда

			Константы.ПрефиксКартыДисконта.Установить(ЭлементСписка.Значение);
			Прервать;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьРазмерРезерваНаСервере()

	РазмерРезерва = ИнформационныеКартыСлужебный.ПолучитьКоличествоРезервныхЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьРазмерРезерва(Команда)

	КомандаОбновитьРазмерРезерваНаСервере();

КонецПроцедуры
